

# MSVC++ 逆向

>原文： http://www.openrce.org/articles/full_view/21
>
>翻译：https://jiayu0x.com/2017/04/25/reversing-msvcxx-exception-handling/



# (一) 异常处理



## 摘要

**MSVC++** 是编写 Win32 应用程序最常用的编译器，所以在 Win32 平台的逆向工作中，懂得其底层工作原理，对逆向工程师来说至关重要。掌握 VC++ 程序的底层原理之后，便能在逆向过程中精准、快速识别编译器生成的**胶水代码**（Glue Code），这样可以让逆向工程师快速聚焦于二进制文件背后的真实程序和真实逻辑。另外，这对还原程序中高层次的结构（**`译注`**：面向对象的数据结构和程序组织结构、异常相关数据结构等）也有莫大帮助。

本文只是系列文章的上半部分（下半部分见： [(译)MSVC++ 逆向（二）—— 类、方法和 RTTI](#（二）类、方法和 RTTI)），主要讲栈展开、异常处理以及 MSVC 编译生成相关的数据结构。阅读本文需要有汇编、寄存器和调用约定相关的知识储备，当然，MSVC++ 的编程基础知识也是必要的。



**名词解释**：

> - **栈帧（Stack Frame）**：**栈** 中为**函数**所用的一个 **片段**，里面通常包含函数相关的**参数**（Arguments）、**返回地址**（Return-to-Caller Address）、**保存的寄存器状态**、**本地变量**（Local Variables）和一些其他的数据。在 **x86** 架构（以及其他多数架构）中，栈里调用和被调用的函数，栈帧通常是连续的；
> - **帧指针（Frame Pointer）**：一个指向栈中特定**位置**的指针，指针值通常保存在寄存器或某个变量中。访问函数中的数据，一般通过帧指针和特定**偏移量**来实现。在 **x86** 架构里，**帧指针**通常保存在寄存器 **`ebp`**中，并且，在栈布局结构中位于**返回地址**的下方；
> - **对象（Object）**：C++ 类的实例；
> - **可销毁对象（Unwindable Object）**：又叫**局部对象**，一个具有 `auto` 作用域的本地对象，当帧指针访问其作用域之外的位置时该对象会被销毁（**`译注`**：函数内部本地变量的默认作用域就是 `auto`，函数被调用的时候其内部变量及其他数据被生成到栈上，调用完毕就会销毁这段栈的片段，其内部变量也就随之被销毁）；
> - **栈展开（Stack Unwinding）**：触发异常的时候，将暂停当前函数的执行，根据 `C++` 的 `try/throw/catch` 异常处理流程或 `SEH` 异常处理机制，会在栈段中线性搜索对应的异常处理函数，如果当前栈帧中没有相应的异常处理模块，就会退出当前函数，释放当前函数的内存并销毁局部对象，继续到上层调用函数中寻找对应的异常处理模块，直到找到可以处理该异常的模块……这个过程就是**栈展开**。

在 C/C++ 程序中，可用的异常处理机制有两种：


> - state 0 -> state -1 (析构 `a1` )

再看 `try` 语句映射表，我们可以推断， `state 1` 和 `state2` 对应 `try` 语句块的执行逻辑，而 `sttate3` 对应 `catch` 语句块的执行逻辑。这样一来，`state 0 -> 1` 的变化代表了 `try` 语句块的**开始**，`state 1 - >0` 代表 `try` 语句块的**结束**。另外，我们还可以推断 `state -1 --> 0` 代表创建 `a1`；`state 1 -> 2` 代表创建 `a2`。具体的状态装换和相应的程序执行逻辑如下图所示：
[![img](./assets/14932976893461.gif)](https://jiayu0x.com/imgs/14932976893461.gif)
看到这里可能会心生疑惑：`1 -> 3` 那个箭头是从哪儿来的？其实这是在异常处理句柄内部发生的，我们从**函数代码**和 `FuncInfo` 结构体中都看不出来罢了。如果一个异常在 `try` 块内部被触发，异常处理句柄在调用相应的 `catch` 块之前，首先要做的就是把栈展开到 `tryLow` 那一层（上面例子中的 `state 1`），然后把状态值 `state` 设置为 `tryHigh+1`（即 `2+1=3`）。

`try` 语句块对应 2 个 `catch` 句柄。第一个有一个 `catch` 的类型（ `char*` ），并且在栈 `-1Ch` 处获取到异常对象。第二个没有对应的异常类型，什么也不做，相当于忽略异常。两个句柄都会返回函数继续执行的地址，这个地址其实就紧随 `try` 块之后。这样我们试着还原一下该函数：

```
void func1 ()
{
    A a1;
    a1.m1 = 1;
    try {
        A a2;
        a2.m1 = 2;
        if (a1.m1 == a1.m2) throw "abc";
    }
    catch(char* e)
    {
        printf("Caught %s\n",e);
    }
    catch(...)
    {
        printf("Caught ...\n");
    }
    printf("after try\n");
}
```

## 附录 3: IDC 辅助脚本

我编写了一个 IDC 脚本用来辅助对 MSVC 程序的逆向分析。它会在整个程序中搜索 SEH/EH 的代码段，并且为所有相关的结构体和结构体元素添加注释。可以被注释的项有**栈变量**、**异常处理句柄**、**异常类型**及其他相关元素。它还能尝试修复 IDA 中误判的函数边界。该脚本的下载链接： [MS SEH/EH 逆向辅助脚本](http://www.openrce.org/downloads/details/196) 。

## 参考资料

### 原文参考资料：

1. http://www.microsoft.com/msj/0197/exception/exception.aspx
2. http://blogs.msdn.com/branbray/archive/2003/11/11/51012.aspx
3. http://blogs.msdn.com/cbrumme/archive/2003/10/01/51524.aspx
4. http://www.codeproject.com/cpp/exceptionhandler.asp
5. http://www.cs.arizona.edu/computer.help/policy/DIGITAL_unix/AA-PY8AC-TET1_html/callCH5.html

### 翻译参考资料

1. http://www.cnblogs.com/samo/articles/3092895.html
2. http://www.cnblogs.com/Winston/archive/2009/04/19/1439184.html
3. https://msdn.microsoft.com/en-us/library/8dbf701c(v=vs.80).aspx
4. http://www.nynaeve.net/?p=91
5. http://www.cnblogs.com/awpatp/archive/2009/11/04/1595988.html
6. https://en.wikibooks.org/wiki/C%2B%2B_Programming/RTTI



# （二）类、方法和 RTTI

这是本系列第二篇（第一篇 👉： [MSVC++ 逆向(1)——异常处理](#(一) 异常处理) ），本篇将介绍 MSVC 中实现的 C++ 底层机制，包括逆向过程中的 **类结构内存布局**、**虚函数**、**RTTI**（**Run-Time Type Information**，运行时类型识别）。阅读本文需要有 C++ 基础知识以及汇编和逆向相关基础。



## 类的内存布局基础

为了方便阐述接下来的内容，先看一段简单的 C++ 代码示例：

```
class A
{
	int a1;
public:
      virtual int A_virt1();
      virtual int A_virt2();
      static void A_static1();
      void A_simple1();
};

class B
{
	int b1;
    int b2;
public:
    virtual int B_virt1();
    virtual int B_virt2();
};

class C: public A, public B
{
    int c1;
public:
    virtual int A_virt2();
    virtual int B_virt2();
};
```

多数情况下 MSVC++ 的 **类** 中个元素在内存布局中的顺序如下：

- 指向**虚函数表**的**指针**（ `_vtable_` 或者 `_vftable_` ），仅当类中有**虚函数**、并且**基类**中没有相应的**虚函数表**的时候才有此指针元素；
- 基类
- 类成员

**虚函数表**中囊括了类中的各个**虚函数**，以虚函数声明的顺序排列。其中，**重载函数** 的 **地址** 覆盖基类中相应函数的地址。如此一来，上面 3 个类在内存中的布局大概如下所示：

```
class A size(8)
       +---
    0  | {vfptr}
    4  | a1
       +---

A's vftable:
    0  | &A::A_virt1
    4  | &A::A_virt2
-----------------------

class B size(12):
        +---
    0   | {vfptr}
    4   | b1
    8   | b2
        +---

B's vftable:
    0   | &B::B_virt1
    4   | &B::B_virt2
-----------------------

class C size(24):
         +---
         | +--- (base class A)
    0    | | {vfptr}
    4    | | a1
         | +---
         | +--- (base class B)
    8    | | {vfptr}
    12   | | b1
    16   | | b2
         | +---
    20   | c1
         +---

C's vftable for A:
    0   | &A::A_virt1
    4   | &C::A_virt2

C's vftable for B:
    0   | &B::B_virt1
    4   | &C::B_virt2
```

上面的图表是在 VC8 中用一个文档中没说明的编译选项生成的，对于编译器产生的类内存布局图表，用 `-d1reportSingleClassLayout` 编译选项可以查看单个类的布局图表；用 `-d1reportAllClassLayout` 可以查看所有类的内存布局（包括内部的 CRT 类），布局图表会在 `stdout` 中输出。

从上面编译器生成的图表可以看出，类 `C` 里有两个 **虚函数表**，这是因为它继承了两个基类，而两个基类均有自己的虚函数成员。在类 C 的第一个虚函数表中，虚函数 `C::A_virt2()` 的地址覆盖了基类 A 在 C 中派生的 `A_virt2()` 的地址；类似地，在类 C 的第二个虚函数表中，虚函数 `C::B_virt2()` 的地址覆盖了基类 B 在 C 中派生的 `B_virt2()` 的地址。

## 调用约定与类方法

