# NT线程详解

## TEB

```c
//x32 nt!_TEB
   +0x000 NtTib            : _NT_TIB
         +0x000 struct _EXCEPTION_REGISTRATION_RECORD  *ExceptionList; //SEH
         +0x004 PVOID                            StackBase; //线程栈底  (高地址)
         +0x008 PVOID                            StackLimit;//线程栈上限(低地址)
         +0x00c PVOID                            SubSystemTib; 
         +0x010 union { 
                    PVOID                FiberData; 
                    DWORD                Version; 
                }; 
         +0x014 PVOID                            ArbitraryUserPointer; 
         +0x018 struct _NT_TIB                   *Self;    //自身线性地址
   +0x01c EnvironmentPointer : Ptr32 Void
   +0x020 ClientId         : _CLIENT_ID
         +0x020 PVOID  UniqueProcess; //PID
         +0x024 PVOID  UniqueThread;  //TID
   +0x028 ActiveRpcHandle  : Ptr32 Void
   +0x02c ThreadLocalStoragePointer : Ptr32 Void
   +0x030 ProcessEnvironmentBlock : Ptr32 _PEB //pPEB
   +0x034 LastErrorValue   : Uint4B
   +0x038 CountOfOwnedCriticalSections : Uint4B
   +0x03c CsrClientThread  : Ptr32 Void
   +0x040 Win32ThreadInfo  : Ptr32 Void
   +0x044 User32Reserved   : [26] Uint4B
   +0x0ac UserReserved     : [5] Uint4B
   +0x0c0 WOW32Reserved    : Ptr32 Void
   +0x0c4 CurrentLocale    : Uint4B
   +0x0c8 FpSoftwareStatusRegister : Uint4B
   +0x0cc SystemReserved1  : [54] Ptr32 Void
   +0x1a4 ExceptionCode    : Int4B
   +0x1a8 ActivationContextStack : _ACTIVATION_CONTEXT_STACK
   +0x1bc SpareBytes1      : [24] UChar
   +0x1d4 GdiTebBatch      : _GDI_TEB_BATCH
   +0x6b4 RealClientId     : _CLIENT_ID
   +0x6bc GdiCachedProcessHandle : Ptr32 Void
   +0x6c0 GdiClientPID     : Uint4B
   +0x6c4 GdiClientTID     : Uint4B
   +0x6c8 GdiThreadLocalInfo : Ptr32 Void
   +0x6cc Win32ClientInfo  : [62] Uint4B
   +0x7c4 glDispatchTable  : [233] Ptr32 Void
   +0xb68 glReserved1      : [29] Uint4B
   +0xbdc glReserved2      : Ptr32 Void
   +0xbe0 glSectionInfo    : Ptr32 Void
   +0xbe4 glSection        : Ptr32 Void
   +0xbe8 glTable          : Ptr32 Void
   +0xbec glCurrentRC      : Ptr32 Void
   +0xbf0 glContext        : Ptr32 Void
   +0xbf4 LastStatusValue  : Uint4B
   +0xbf8 StaticUnicodeString : _UNICODE_STRING
   +0xc00 StaticUnicodeBuffer : [261] Uint2B
   +0xe0c DeallocationStack : Ptr32 Void
   +0xe10 TlsSlots         : [64] Ptr32 Void
   +0xf10 TlsLinks         : _LIST_ENTRY
   +0xf18 Vdm              : Ptr32 Void
   +0xf1c ReservedForNtRpc : Ptr32 Void
   +0xf20 DbgSsReserved    : [2] Ptr32 Void
   +0xf28 HardErrorsAreDisabled : Uint4B
   +0xf2c Instrumentation  : [16] Ptr32 Void
   +0xf6c WinSockData      : Ptr32 Void
   +0xf70 GdiBatchCount    : Uint4B
   +0xf74 InDbgPrint       : UChar
   +0xf75 FreeStackOnTermination : UChar
   +0xf76 HasFiberData     : UChar
   +0xf77 IdealProcessor   : UChar
   +0xf78 Spare3           : Uint4B
   +0xf7c ReservedForPerf  : Ptr32 Void
   +0xf80 ReservedForOle   : Ptr32 Void
   +0xf84 WaitingOnLoaderLock : Uint4B
   +0xf88 Wx86Thread       : _Wx86ThreadState
   +0xf94 TlsExpansionSlots : Ptr32 Ptr32 Void
   +0xf98 ImpersonationLocale : Uint4B
   +0xf9c IsImpersonating  : Uint4B
   +0xfa0 NlsCache         : Ptr32 Void
   +0xfa4 pShimData        : Ptr32 Void
   +0xfa8 HeapVirtualAffinity : Uint4B
   +0xfac CurrentTransactionHandle : Ptr32 Void
   +0xfb0 ActiveFrame      : Ptr32 _TEB_ACTIVE_FRAME
   +0xfb4 SafeThunkCall    : UChar
   +0xfb5 BooleanSpare     : [3] UChar
```

```c++
//x64
struct _ACTIVATION_CONTEXT_STACK
{
    struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;                //0x0
    struct _LIST_ENTRY FrameListCache;                                      //0x8
    ULONG Flags;                                                            //0x18
    ULONG NextCookieSequenceNumber;                                         //0x1c
    ULONG StackId;                                                          //0x20
};
struct _GDI_TEB_BATCH
{
    ULONG Offset : 31;                                                      //0x0
    ULONG HasRenderingCommand : 1;                                          //0x0
    ULONGLONG HDC;                                                          //0x8
    ULONG Buffer[310];                                                      //0x10
};
struct _CLIENT_ID
{
    DWORD64 UniqueProcess;                                                    //0x0
    DWORD64 UniqueThread;                                                     //0x8
};
static_assert(sizeof(_CLIENT_ID) == 0x10, "_CLIENT_ID Size check");

static_assert(sizeof(_NT_TIB) == 0x38, "_NT_TIB Size check");
typedef struct X64TEB {
    struct _NT_TIB NtTib;                                                   //0x0
    VOID* EnvironmentPointer;                                               //0x38
    struct _CLIENT_ID ClientId;                                             //0x40
    VOID* ActiveRpcHandle;                                                  //0x50
    VOID* ThreadLocalStoragePointer;                                        //0x58
    struct _PEB* ProcessEnvironmentBlock;                                   //0x60
    ULONG LastErrorValue;                                                   //0x68
    ULONG CountOfOwnedCriticalSections;                                     //0x6c
    VOID* CsrClientThread;                                                  //0x70
    VOID* Win32ThreadInfo;                                                  //0x78
    ULONG User32Reserved[26];                                               //0x80
    ULONG UserReserved[5];                                                  //0xe8
    VOID* WOW32Reserved;                                                    //0x100
    ULONG CurrentLocale;                                                    //0x108
    ULONG FpSoftwareStatusRegister;                                         //0x10c
    VOID* ReservedForDebuggerInstrumentation[16];                           //0x110
    VOID* SystemReserved1[30];                                              //0x190
    CHAR PlaceholderCompatibilityMode;                                      //0x280
    UCHAR PlaceholderHydrationAlwaysExplicit;                               //0x281
    CHAR PlaceholderReserved[10];                                           //0x282
    ULONG ProxiedProcessId;                                                 //0x28c
    struct _ACTIVATION_CONTEXT_STACK _ActivationStack;                      //0x290
    UCHAR WorkingOnBehalfTicket[8];                                         //0x2b8
    LONG ExceptionCode;                                                     //0x2c0
    UCHAR Padding0[4];                                                      //0x2c4
    struct _ACTIVATION_CONTEXT_STACK* ActivationContextStackPointer;        //0x2c8
    ULONGLONG InstrumentationCallbackSp;                                    //0x2d0
    ULONGLONG InstrumentationCallbackPreviousPc;                            //0x2d8
    ULONGLONG InstrumentationCallbackPreviousSp;                            //0x2e0
    ULONG TxFsContext;                                                      //0x2e8
    UCHAR InstrumentationCallbackDisabled;                                  //0x2ec
    UCHAR UnalignedLoadStoreExceptions;                                     //0x2ed
    UCHAR Padding1[2];                                                      //0x2ee
    struct _GDI_TEB_BATCH GdiTebBatch;                                      //0x2f0
    struct _CLIENT_ID RealClientId;                                         //0x7d8
    VOID* GdiCachedProcessHandle;                                           //0x7e8
    ULONG GdiClientPID;                                                     //0x7f0
    ULONG GdiClientTID;                                                     //0x7f4
    VOID* GdiThreadLocalInfo;                                               //0x7f8
    ULONGLONG Win32ClientInfo[62];                                          //0x800
    VOID* glDispatchTable[233];                                             //0x9f0
    ULONGLONG glReserved1[29];                                              //0x1138
    VOID* glReserved2;                                                      //0x1220
    VOID* glSectionInfo;                                                    //0x1228
    VOID* glSection;                                                        //0x1230
    VOID* glTable;                                                          //0x1238
    VOID* glCurrentRC;                                                      //0x1240
    VOID* glContext;                                                        //0x1248
    ULONG LastStatusValue;                                                  //0x1250
    UCHAR Padding2[4];                                                      //0x1254
    struct _UNICODE_STRING StaticUnicodeString;                             //0x1258
    WCHAR StaticUnicodeBuffer[261];                                         //0x1268
    UCHAR Padding3[6];                                                      //0x1472
    VOID* DeallocationStack;                                                //0x1478
    VOID* TlsSlots[64];                                                     //0x1480
    struct _LIST_ENTRY TlsLinks;                                            //0x1680
    VOID* Vdm;                                                              //0x1690
    VOID* ReservedForNtRpc;                                                 //0x1698
    VOID* DbgSsReserved[2];                                                 //0x16a0
    ULONG HardErrorMode;                                                    //0x16b0
    UCHAR Padding4[4];                                                      //0x16b4
    VOID* Instrumentation[11];                                              //0x16b8
    struct _GUID ActivityId;                                                //0x1710
    VOID* SubProcessTag;                                                    //0x1720
    VOID* PerflibData;                                                      //0x1728
    VOID* EtwTraceData;                                                     //0x1730
    VOID* WinSockData;                                                      //0x1738
    ULONG GdiBatchCount;                                                    //0x1740
    union
    {
        struct _PROCESSOR_NUMBER CurrentIdealProcessor;                     //0x1744
        ULONG IdealProcessorValue;                                          //0x1744
        struct
        {
            UCHAR ReservedPad0;                                             //0x1744
            UCHAR ReservedPad1;                                             //0x1745
            UCHAR ReservedPad2;                                             //0x1746
            UCHAR IdealProcessor;                                           //0x1747
        };
    };
    ULONG GuaranteedStackBytes;                                             //0x1748
    UCHAR Padding5[4];                                                      //0x174c
    VOID* ReservedForPerf;                                                  //0x1750
    VOID* ReservedForOle;                                                   //0x1758
    ULONG WaitingOnLoaderLock;                                              //0x1760
    UCHAR Padding6[4];                                                      //0x1764
    VOID* SavedPriorityState;                                               //0x1768
    ULONGLONG ReservedForCodeCoverage;                                      //0x1770
    VOID* ThreadPoolData;                                                   //0x1778
    VOID** TlsExpansionSlots;                                               //0x1780
    VOID* DeallocationBStore;                                               //0x1788
    VOID* BStoreLimit;                                                      //0x1790
    ULONG MuiGeneration;                                                    //0x1798
    ULONG IsImpersonating;                                                  //0x179c
    VOID* NlsCache;                                                         //0x17a0
    VOID* pShimData;                                                        //0x17a8
    ULONG HeapData;                                                         //0x17b0
    UCHAR Padding7[4];                                                      //0x17b4
    VOID* CurrentTransactionHandle;                                         //0x17b8
    struct _TEB_ACTIVE_FRAME* ActiveFrame;                                  //0x17c0
    VOID* FlsData;                                                          //0x17c8
    VOID* PreferredLanguages;                                               //0x17d0
    VOID* UserPrefLanguages;                                                //0x17d8
    VOID* MergedPrefLanguages;                                              //0x17e0
    ULONG MuiImpersonation;                                                 //0x17e8
    union
    {
        volatile USHORT CrossTebFlags;                                      //0x17ec
        USHORT SpareCrossTebBits : 16;                                        //0x17ec
    };
    union
    {
        USHORT SameTebFlags;                                                //0x17ee
        struct
        {
            USHORT SafeThunkCall : 1;                                         //0x17ee
            USHORT InDebugPrint : 1;                                          //0x17ee
            USHORT HasFiberData : 1;                                          //0x17ee
            USHORT SkipThreadAttach : 1;                                      //0x17ee
            USHORT WerInShipAssertCode : 1;                                   //0x17ee
            USHORT RanProcessInit : 1;                                        //0x17ee
            USHORT ClonedThread : 1;                                          //0x17ee
            USHORT SuppressDebugMsg : 1;                                      //0x17ee
            USHORT DisableUserStackWalk : 1;                                  //0x17ee
            USHORT RtlExceptionAttached : 1;                                  //0x17ee
            USHORT InitialThread : 1;                                         //0x17ee
            USHORT SessionAware : 1;                                          //0x17ee
            USHORT LoadOwner : 1;                                             //0x17ee
            USHORT LoaderWorker : 1;                                          //0x17ee
            USHORT SkipLoaderInit : 1;                                        //0x17ee
            USHORT SpareSameTebBits : 1;                                      //0x17ee
        };
    };
    VOID* TxnScopeEnterCallback;                                            //0x17f0
    VOID* TxnScopeExitCallback;                                             //0x17f8
    VOID* TxnScopeContext;                                                  //0x1800
    ULONG LockCount;                                                        //0x1808
    LONG WowTebOffset;                                                      //0x180c
    VOID* ResourceRetValue;                                                 //0x1810
    VOID* ReservedForWdf;                                                   //0x1818
    ULONGLONG ReservedForCrt;                                               //0x1820
    struct _GUID EffectiveContainerId;                                      //0x1828
};
static_assert(sizeof(X64TEB) == 0x1838, "TEB Size check");
```



## EThread

执行体对象

```c++
//https://blog.csdn.net/kwansy/
typedef struct _ETHREAD {
    KTHREAD Tcb;
    LARGE_INTEGER CreateTime;// 线程创建时间
    union {
        LARGE_INTEGER ExitTime;// 线程退出时间
        LIST_ENTRY LpcReplyChain;// 用于跨进程通信
        LIST_ENTRY KeyedWaitChain;// 带键事件等待链表  
    };
    union {
        NTSTATUS ExitStatus;// 线程退出状态
        PVOID OfsChain;// WRK不使用
    };
    // Registry
    // PCM_POST_BLOCK 链表头，用于线程向配置管理器登记注册表键的变化通知
    LIST_ENTRY PostBlockList;

    // Single linked list of termination blocks
    union {
        // List of termination ports
        PTERMINATION_PORT TerminationPort;// 线程退出时，系统通知所有已经登记过要接收其终止事件的端口

        // List of threads to be reaped. Only used at thread exit
        // 线程退出时，该节点挂到 PsReaperListHead 链表上，在线程回收器（reaper）
        // 的工作项目（WorkItem）中该线程的内核栈得以收回。
        struct _ETHREAD *ReaperLink;

        // Keyvalue being waited for
        PVOID KeyedWaitValue;// 带键事件的键值

    };
    KSPIN_LOCK ActiveTimerListLock;// 定时器链表自旋锁
    LIST_ENTRY ActiveTimerListHead;// 包含当前线程的所有定时器

    // 线程唯一标识符，由两部分组成，UniqueProcess 和 UniqueThread，
    // UniqueProcess 等于所属进程的 UniqueProcessId ，UniqueThread 等于
    // 此线程对象在进程句柄表中的句柄
    CLIENT_ID Cid;

    // Lpc
    union {
        KSEMAPHORE LpcReplySemaphore;// LPC应答通知
        KSEMAPHORE KeyedWaitSemaphore;// 用于处理带键的事件
    };

    // 通过最低位区分使用哪个，参见 base\ntos\lpc\lpcp.h 中的 LpcpGetThreadMessage 
    // 和 LpcpGetThreadPort 宏
    union {
        // 指向 LPCP_MESSAGE 的指针，包含LPC应答消息
        PVOID LpcReplyMessage;          // -> Message that contains the reply
        PVOID LpcWaitingOnPort;// LPC 等待端口
    };

    //
    // Security
    //    Client - If non null, indicates the thread is impersonating
    //        a client.
    PPS_IMPERSONATION_INFORMATION ImpersonationInfo;// 线程的模仿信息
    
    // Io
    // 此链表包含当前线程所有正在处理但尚未完成的I/O请求（IRP对象）
    LIST_ENTRY IrpList;

    //  File Systems
    // 指向线程的顶级IRP，它或者指向NULL，或指向一个IRP，或包含了 fsrtl.h 中定义的标记
    // FSRTL_FAST_IO_TOP_LEVEL_IRP 或FSRTL_FSP_TOP_LEVEL_IRP ，仅当一个线程
    // 的I/O调用层次中最顶级的组件是文件系统时，TopLevelIrp 域才指向当前 IRP
    ULONG_PTR TopLevelIrp;  // either NULL, an Irp or a flag defined in FsRtl.h
    
    // 指向一个待检验的设备对象，当磁盘或CD-ROM设备驱动发现自从上一次该线程访问该设备以来，该
    // 设备似乎发生了变化，就会设置此域，从而使最高层的驱动程序，如文件系统，可以检查到设备的变化
    struct _DEVICE_OBJECT *DeviceToVerify;

    // 当前线程所属的进程，线程初始化时赋值（应该是指父进程，和ApcState里的要有所区分）
    // THREAD_TO_PROCESS 宏就是通过此成员实现的
    PEPROCESS ThreadsProcess;
    
    // 线程的启动地址，这是真正的线程启动地址，包含的通常是系统DLL中的线程启动地址，因而
    // 往往是相同的（譬如kernel32.dll 中的BaseProcessStart 或BaseThreadStart 函数）
    PVOID StartAddress;
    
    // 当windows子系统线程接收LPC消息时，它的Win32StartAddress 域也会被修改
    union {
        // windows子系统的启动地址，即 CreateThread API 接收到的线程启动地址
        PVOID Win32StartAddress;
        
        // 接收到的LPC消息的ID，此域仅当 SameThreadApcFlags 域中的 
        // LpcReceivedMsgIdValid 位被置上的时候才有效
        ULONG LpcReceivedMessageId;
    };
    // Ps
    // 冗余设计，链接所属进程的所有线程
    LIST_ENTRY ThreadListEntry;
    
    // Rundown protection structure. Acquire this to do cross thread
    // TEB, TEB32 or stack references.
    // 线程停止保护锁，跨线程引用 TEB 结构或者挂起线程等操作需要获得此锁才能进行，
    // 以免在操作过程中线程被销毁
    EX_RUNDOWN_REF RundownProtect;

    // Lock to protect thread impersonation information
    // 推锁，保护线程数据属性，例如 PspLockThreadSecurityExclusive 和
	// PspLockThreadSecurityShared 利用该域来保护线程的安全属性
    EX_PUSH_LOCK ThreadLock;

    // 指明当前线程正在等待对一个消息的应答
    ULONG LpcReplyMessageId;    // MessageId this thread is waiting for reply to

    // 指明了在一次I/O操作中读取多少个页面，用于页面交换文件和内存映射文件的读操作
    ULONG ReadClusterSize;

    // Client/server
    // 线程访问权限，详见 public\sdk\inc\ntpsapi.h 中的宏THREAD_<XXX>，
    // 例如 THREAD_TERMINATE 代表终止线程的权限
    ACCESS_MASK GrantedAccess;
    
    // Flags for cross thread access. Use interlocked operations
    // via PS_SET_BITS etc.
    // Used to signify that the delete APC has been queued or the
    // thread has called PspExitThread itself.
    #define PS_CROSS_THREAD_FLAGS_TERMINATED           0x00000001UL
    // Thread create failed
    #define PS_CROSS_THREAD_FLAGS_DEADTHREAD           0x00000002UL
    // Debugger isn't shown this thread
    #define PS_CROSS_THREAD_FLAGS_HIDEFROMDBG          0x00000004UL
    // Thread is impersonating
    #define PS_CROSS_THREAD_FLAGS_IMPERSONATING        0x00000008UL
    // This is a system thread
    #define PS_CROSS_THREAD_FLAGS_SYSTEM               0x00000010UL
    // Hard errors are disabled for this thread
    #define PS_CROSS_THREAD_FLAGS_HARD_ERRORS_DISABLED 0x00000020UL
    // We should break in when this thread is terminated
    #define PS_CROSS_THREAD_FLAGS_BREAK_ON_TERMINATION 0x00000040UL
    // This thread should skip sending its create thread message
    #define PS_CROSS_THREAD_FLAGS_SKIP_CREATION_MSG    0x00000080UL
    // This thread should skip sending its final thread termination message
    #define PS_CROSS_THREAD_FLAGS_SKIP_TERMINATION_MSG 0x00000100UL
    union {
        // 针对跨线程访问的标志位，详见下面的位域结构体
        ULONG CrossThreadFlags;
        // The following fields are for the debugger only. Do not use.
        // Use the bit definitions instead.
        struct {
            ULONG Terminated              : 1;	// 线程已执行终止操作
            ULONG DeadThread              : 1;	// 创建失败
            ULONG HideFromDebugger        : 1;	// 该线程对调试器不可见
            ULONG ActiveImpersonationInfo : 1;	// 线程正在模仿
            ULONG SystemThread            : 1;	// 系统线程
            ULONG HardErrorsAreDisabled   : 1;	// 硬件错误无效
            ULONG BreakOnTermination      : 1;	// 调试器在线程终止时停下该线程
            ULONG SkipCreationMsg         : 1;	// 不向调试器发送创建消息
            ULONG SkipTerminationMsg      : 1;	// 不向调试器发送终止消息
        };
    };
    // Flags to be accessed in this thread's context only at PASSIVE
    // level -- no need to use interlocked operations.
    //
    union {
        // 一些只有在最低中断等级（0 被动级别）上才可以访问的标志位，并且只能被该线程自身访问
        // 所以对这些标志位的访问不需要互锁操作
        ULONG SameThreadPassiveFlags;

        struct {
            // This thread is an active Ex worker thread; it should
            // not terminate.
            ULONG ActiveExWorker : 1;
            ULONG ExWorkerCanWaitUser : 1;
            ULONG MemoryMaker : 1;

            // Thread is active in the keyed event code. LPC should not run above this in an APC.
            ULONG KeyedEventInUse : 1;
        };
    };

    // Flags to be accessed in this thread's context only at APC_LEVEL.
    // No need to use interlocked operations.
    union {
        // 一些在APC中断级别上被该线程自身访问的标志位，同样不需要互锁
        ULONG SameThreadApcFlags;
        struct {
            // The stored thread's MSGID is valid. This is only accessed
            // while the LPC mutex is held so it's an APC_LEVEL flag.
            BOOLEAN LpcReceivedMsgIdValid : 1;
            BOOLEAN LpcExitThreadCalled   : 1;
            BOOLEAN AddressSpaceOwner     : 1;
            BOOLEAN OwnsProcessWorkingSetExclusive  : 1;
            BOOLEAN OwnsProcessWorkingSetShared     : 1;
            BOOLEAN OwnsSystemWorkingSetExclusive   : 1;
            BOOLEAN OwnsSystemWorkingSetShared      : 1;
            BOOLEAN OwnsSessionWorkingSetExclusive  : 1;
            BOOLEAN OwnsSessionWorkingSetShared     : 1;

            #define PS_SAME_THREAD_FLAGS_OWNS_A_WORKING_SET    0x000001F8UL

            BOOLEAN ApcNeeded                       : 1;
        };
    };
    BOOLEAN ForwardClusterOnly;// 指示是否仅仅前向聚集
    BOOLEAN DisablePageFaultClustering;// 控制页面交换的聚集与否
    UCHAR ActiveFaultCount;// 正在进行之中的页面错误数量

#if defined (PERF_DATA)
    ULONG PerformanceCountLow;
    LONG PerformanceCountHigh;
#endif

} ETHREAD, *PETHREAD;
```



## Context

```c++
typedef struct _CONTEXT {
    DWORD ContextFlags; //在查询的时候需要设置该字段，表示查询哪些其他的CONTEXT结构字段。

	//调试寄存器组
    DWORD   Dr0;
    DWORD   Dr1;
    DWORD   Dr2;
    DWORD   Dr3;
    DWORD   Dr6;
    DWORD   Dr7;

    FLOATING_SAVE_AREA FloatSave; //浮点寄存器
 
	//段寄存器组
    DWORD   SegGs;
    DWORD   SegFs;
    DWORD   SegEs;
    DWORD   SegDs;

    //通用数据寄存器（整型寄存器）组
    DWORD   Edi;
    DWORD   Esi;
    DWORD   Ebx;
    DWORD   Edx;
    DWORD   Ecx;
    DWORD   Eax;

	//控制寄存器组——比如CS、BP、SP之类的保存基址指针和堆栈指针、程序计数器
    DWORD   Ebp;
    DWORD   Eip;
    DWORD   SegCs;              // MUST BE SANITIZED
    DWORD   EFlags;             // MUST BE SANITIZED
    DWORD   Esp;
    DWORD   SegSs;

    BYTE    ExtendedRegisters[MAXIMUM_SUPPORTED_EXTENSION]; //扩展寄存器组
} CONTEXT;
```

```c++
CONTEXT Context;
SuspendThread(hThread);//挂起线程
Context.ContextFlags = CONTEXT_CONTROL;
GetThreadContext(hThread, &Context);//获取线程Context
Context.Eip = 0x00010000;//修改EIP，也就是修改了当前执行的代码，后续线程激活后，会在这个地址继续执行（这个地址是为了演示随意填写的，由于这个地址问题，程序可能会崩溃）  
Context.ContextFlags = CONTEXT_CONTROL;     
SetThreadContext(hThread, &Context);//设置线程Context    
ResumeThread(hThread);//恢复线程运行，此时程序从0x00010000地址处开始运行，程序会异常
```



## CreateThread

调用`CreateThread`

a)创建用户空间堆栈
b)初始化CONTEXT结构体
c)初始化OBJECT_ATTRIBUTES结构体，此结构体在创建线程对象的时候使用。
d)调用NtCreateThread,进入内核空间。

```c
NTSTATUS
NtCreateThread(
    __out PHANDLE ThreadHandle,
    __in ACCESS_MASK DesiredAccess,
    __in_opt POBJECT_ATTRIBUTES ObjectAttributes,
    __in HANDLE ProcessHandle,
    __out PCLIENT_ID ClientId,
    __in PCONTEXT ThreadContext,
    __in PINITIAL_TEB InitialTeb,
    __in BOOLEAN CreateSuspended
    )
/*++

Routine Description:
    This system service API creates and initializes a thread object.
    该API创建一个初始化过的线程对象
Arguments:
    ThreadHandle - Returns the handle for the new thread.
	返回值：返回线程句柄
    DesiredAccess - Supplies the desired access modes to the new thread.
    线程权限
    ObjectAttributes - Supplies the object attributes of the new thread.
	对象属性
    ProcessHandle - Supplies a handle to the process that the thread is being
                    created within.
    创建线程的进程句柄
    ClientId - Returns the CLIENT_ID of the new thread.
    返回值：返回进程和线程句柄结构体
    ThreadContext - Supplies an initial context for the new thread.
    初始化过的线程上下文 （系统线程则为null）
    InitialTeb - Supplies the initial contents for the thread's TEB.
    初始化过的TEB
    CreateSuspended - Supplies a value that controls whether or not a
                      thread is created in a suspended state.
    创建完成后是否挂起
--*/
```





## TLS

Thread Local Storage(TLS)，是Windows为解决一个进程中多个线程同时访问全局变量而提供的机制。TLS可以简单地由操作系统代为完成整个互斥过程，也可以由用户自己编写控制信号量的函数。当进程中的线程访问预先制定的内存空间时，操作系统会调用系统默认的或用户自定义的信号量函数，保证数据的完整性与正确性。

### TLS回调函数

函数原型

```c
void NTAPI TlsCallBackFunction(PVOID Handle, DWORD Reason, PVOID Reserve);
```

### TLS数据结构

在PE中的结构

```c++
//PE: IMAGE_NT_HEADERS.OptionalHeader.DataDirectory[IMAGE_DIRECTORY_ENTRY_TLS]
typedef struct _IMAGE_DATA_DIRECTORY {
    DWORD   VirtualAddress;
    DWORD   Size;
} IMAGE_DATA_DIRECTORY, *PIMAGE_DATA_DIRECTORY;
```

### TLS例子

必须为TLS数据单独建一个数据段，用相关数据填充此段，并通知链接器为TLS数据在PE文件头中添加数据

```c++
#pragma comment(linker, "/INCLUDE:__tls_used")
#pragma data_seg(".CRT$XLB")
//程序初始化时都会被调用
PIMAGE_TLS_CALLBACK TlsCallBackArray[] = {
	TlsCallBackFunction1,
	TlsCallBackFunction2,
	......
	NULL//数组必须以NULL指针结束
};
#pragma data_seg()
```

