## NT进程详解

## PEB

```c
   +0x000 InheritedAddressSpace : UChar
   +0x001 ReadImageFileExecOptions : UChar
   +0x002 BeingDebugged    : UChar
   +0x003 SpareBool        : UChar
   +0x004 Mutant           : Ptr32 Void
   +0x008 ImageBaseAddress : Ptr32 Void // 程序基地址
   +0x00c Ldr              : Ptr32 _PEB_LDR_DATA // 模块链表
   +0x010 ProcessParameters : Ptr32 _RTL_USER_PROCESS_PARAMETERS //进程的参数(ProcessParameters.CommandLine.Buffer)
   +0x014 SubSystemData    : Ptr32 Void
   +0x018 ProcessHeap      : Ptr32 Void
   +0x01c FastPebLock      : Ptr32 _RTL_CRITICAL_SECTION
   +0x020 FastPebLockRoutine : Ptr32 Void
   +0x024 FastPebUnlockRoutine : Ptr32 Void
   +0x028 EnvironmentUpdateCount : Uint4B
   +0x02c KernelCallbackTable : Ptr32 Void// 用于从内核回调用户空间的函数
   +0x030 SystemReserved   : [1] Uint4B
   +0x034 AtlThunkSListPtr32 : Uint4B
   +0x038 FreeList         : Ptr32 _PEB_FREE_BLOCK
   +0x03c TlsExpansionCounter : Uint4B
   +0x040 TlsBitmap        : Ptr32 Void
   +0x044 TlsBitmapBits    : [2] Uint4B
   +0x04c ReadOnlySharedMemoryBase : Ptr32 Void
   +0x050 ReadOnlySharedMemoryHeap : Ptr32 Void
   +0x054 ReadOnlyStaticServerData : Ptr32 Ptr32 Void
   +0x058 AnsiCodePageData : Ptr32 Void
   +0x05c OemCodePageData  : Ptr32 Void
   +0x060 UnicodeCaseTableData : Ptr32 Void
   +0x064 NumberOfProcessors : Uint4B
   +0x068 NtGlobalFlag     : Uint4B
   +0x070 CriticalSectionTimeout : _LARGE_INTEGER
   +0x078 HeapSegmentReserve : Uint4B
   +0x07c HeapSegmentCommit : Uint4B
   +0x080 HeapDeCommitTotalFreeThreshold : Uint4B
   +0x084 HeapDeCommitFreeBlockThreshold : Uint4B
   +0x088 NumberOfHeaps    : Uint4B
   +0x08c MaximumNumberOfHeaps : Uint4B
   +0x090 ProcessHeaps     : Ptr32 Ptr32 Void
   +0x094 GdiSharedHandleTable : Ptr32 Void
   +0x098 ProcessStarterHelper : Ptr32 Void
   +0x09c GdiDCAttributeList : Uint4B
   +0x0a0 LoaderLock       : Ptr32 Void
   +0x0a4 OSMajorVersion   : Uint4B
   +0x0a8 OSMinorVersion   : Uint4B
   +0x0ac OSBuildNumber    : Uint2B
   +0x0ae OSCSDVersion     : Uint2B
   +0x0b0 OSPlatformId     : Uint4B
   +0x0b4 ImageSubsystem   : Uint4B
   +0x0b8 ImageSubsystemMajorVersion : Uint4B
   +0x0bc ImageSubsystemMinorVersion : Uint4B
   +0x0c0 ImageProcessAffinityMask : Uint4B
   +0x0c4 GdiHandleBuffer  : [34] Uint4B
   +0x14c PostProcessInitRoutine : Ptr32     void
   +0x150 TlsExpansionBitmap : Ptr32 Void
   +0x154 TlsExpansionBitmapBits : [32] Uint4B
   +0x1d4 SessionId        : Uint4B
   +0x1d8 AppCompatFlags   : _ULARGE_INTEGER
   +0x1e0 AppCompatFlagsUser : _ULARGE_INTEGER
   +0x1e8 pShimData        : Ptr32 Void
   +0x1ec AppCompatInfo    : Ptr32 Void
   +0x1f0 CSDVersion       : _UNICODE_STRING
   +0x1f8 ActivationContextData : Ptr32 Void
   +0x1fc ProcessAssemblyStorageMap : Ptr32 Void
   +0x200 SystemDefaultActivationContextData : Ptr32 Void
   +0x204 SystemAssemblyStorageMap : Ptr32 Void
   +0x208 MinimumStackCommit : Uint4B
```

## LDR

```c++
typedef struct _PEB_LDR_DATA {
+000h    ULONG               Length;
+004h    BOOLEAN             Initialized; // 此处需字节对齐
+008h    PVOID               SsHandle;
+00Ch    LIST_ENTRY          InLoadOrderModuleList; //按加载顺序链接LDR
+014h    LIST_ENTRY          InMemoryOrderModuleList; //按内存顺序链接LDR
+01Ch    LIST_ENTRY          InInitializationOrderModuleList; //按初始化顺序链接LDR
+024h    PVOID               EntryInProgress;
} PEB_LDR_DATA, *PPEB_LDR_DATA;

typedef struct _LIST_ENTRY {
+001h    _LIST_ENTRY*        Flink; // 指向下一个节点
+004h    _LIST_ENTRY*        Blink; // 指向前一个节点
} LIST_ENTRY, *PLIST_ENTRY;

typedef struct _LDR_MODULE {
+000h    LIST_ENTRY          InLoadOrderModuleList;           // 按加载模块顺序的模块链表
+008h    LIST_ENTRY          InMemoryOrderModuleList;         // 按在内存中顺序的模块链表
+010h    LIST_ENTRY          InInitializationOrderModuleList; // 按初始化顺序
+018h    PVOID               BaseAddress; // 模块的基地址
+01Ch    PVOID               EntryPoint;  // 模块的入口
+020h    ULONG               SizeOfImage; // 模块镜像大小
+024h    UNICODE_STRING      FullDllName; // 模块的路径名
+028h    UNICODE_STRING      BaseDllName; // 模块名
+02Ch    ULONG               Flags;
+030h    SHORT               LoadCount;   // 引用计数
+032h    SHORT               TlsIndex;
+034h    LIST_ENTRY          HashTableEntry; 
+03Ch    ULONG               TimeDateStamp; 
} LDR_MODULE, *PLDR_MODULE;
```

### LDR Unlink - HideModule

可以通过LDR断链隐藏一个或多个模块

```c++
//断链指定句柄模块
void UnlinkLdr(PLIST_ENTRY head,HMODULE hModule){
	PLIST_ENTRY Head, Cur; // Head 指向链表第一项，第一项不存储模块信息；Cur指向第二项，是第一个存储了模块信息的项
	Head = head;
	Cur = Head->Flink;
    //参数为空直接快速断链全部
    if(hModule==null){
        Head->Flink = Head->Blink = Head;
        return;
    }
	do{
		// CONTAINING_RECORD宏的作用是传入一个地址，一个结构体类型和该地址属于结构体中的哪个属性，返回结构体基址
		ldte = CONTAINING_RECORD( Cur, LDR_DATA_TABLE_ENTRY, InLoadOrderModuleList);
		if (ldte->BaseAddress == hModule){		
			// 断链
			ldte->InLoadOrderModuleList.Blink->Flink = ldte->InLoadOrderModuleList.Flink;  
			ldte->InLoadOrderModuleList.Flink->Blink = ldte->InLoadOrderModuleList.Blink;		 
		}
		Cur = Cur->Flink;
	} while(Head != Cur);
}
void HideModule(HMODULE hModule)
{	
	PPEB_LDR_DATA ldr;  
	PLDR_DATA_TABLE_ENTRY ldte;
	// 获取LDR
	__asm
	{
		mov eax,fs:[0x30] // PEB 
		mov ecx,[eax + 0x0c] // LDR
		mov ldr,ecx  
	}
	// 分别将三个链表断链处理
    Unlink(&(ldr->InLoadOrderModuleList),hModule);
    Unlink(&(ldr->InMemoryOrderModuleList),hModule);
    Unlink(&(ldr->InInitializationOrderModuleList),hModule);
}
```



## HandleTable



## Win32Api

获取程序基址

```c++
GetModuleHandle(NULL);
```

阻止dll注入

ACG mitigation机制

```
PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY sp = {};
sp.MicrosoftSignedOnly = 1;
SetProcessMitigationPolicy(ProcessSignaturePolicy, &sp, sizeof(sp));
```

对应Eprocess里的ProcessMitigation



## VEH



## SEH





[(9条消息) 进程线程创建过程_hambaga的博客-CSDN博客](https://blog.csdn.net/Kwansy/article/details/110938883)

[Virtual Memory - Intro to Paging Tables // Back Engineering Blog](https://blog.back.engineering/23/08/2020/)

[(9条消息) XP内核（海哥中级）_hambaga的博客-CSDN博客](https://blog.csdn.net/kwansy/category_10411796.html)

https://github.com/DarthTon/Blackbone/

https://idiotc4t.com/

[Windows Pwn安全防护机制 (ble55ing.github.io)](https://ble55ing.github.io/2019/08/18/WindowsPwn0/)

[Rootkit.com](http://rootkit.com/)

[secret club | We Break Software](https://secret.club/)

[[分享\]TLS隐藏的入口点-软件逆向-看雪-安全社区|安全招聘|kanxue.com](https://bbs.kanxue.com/thread-63237-1.htm)

[pwntrick | Lock's blog (locksec.top)](http://locksec.top/2021/01/02/pwntrick/#toc-heading-9)

[The “Ultimate”Anti-Debugging Reference (anti-reversing.com)](https://anti-reversing.com/Downloads/Anti-Reversing/The_Ultimate_Anti-Reversing_Reference.pdf)

[An Anti-Reverse Engineering Guide - CodeProject](https://www.codeproject.com/Articles/30815/An-Anti-Reverse-Engineering-Guide#OllyFindWindow)

[(译)MSVC++ 逆向（二）—— 类、方法和 RTTI | JiaYu's Blog (jiayu0x.com)](https://jiayu0x.com/2017/04/30/reversing-msvcxx-exception-handling-2/)